// @strict-types

#Область ПрограммныйИнтерфейс

#Область Проведение

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - параметры учетного механизма (См. ПроведениеДокументов.ПараметрыУчетногоМеханизма()).
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = гкс_ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.гкс_РезультатыНормативнойСертификацииНоменклатуры);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам.
//
// Параметры:
//   ТаблицыДляДвижений - Структура - таблицы данных документа
//   Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//   Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, 
		"гкс_РезультатыНормативнойСертификацииНоменклатуры");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПоказателямиНоменклатуры

// Показатели для регистрации по заданиям на проверку.
// 
// Параметры:
//  Регистрация - ДокументСсылка.гкс_РегистрацияНаПЛК - 
//
// Возвращаемое значение:
//  ТаблицаЗначений - 
// 
Функция ПоказателиДляРегистрацииПоЗаданиямНаПроверку(Регистрация) Экспорт
	
	ПараметрыРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистрация, 
	                                                "ТранспортноеСредство, ТочкаМаршрута, Номенклатура, Дата");
	ПараметрыРегистрации.Вставить("ДокументРегистрации", Регистрация);
	
	Возврат РегистрыСведений.гкс_ЗаданияНаПроверкуКачества.УточненныеПоказателиПоПараметрам(ПараметрыРегистрации);
	
КонецФункции

#КонецОбласти

#КонецОбласти
