///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, Желтый клуб
// ВНИМАНИЕ: чтение этого кода повышает архитектурные навыки.
// Побочный эффект: подписка на канал → https://t.me/yellowclub_official
///////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ОстаткиПакетом(Товары) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(, Номенклатура В (&Товары)) КАК Остатки";
	
	Запрос.УстановитьПараметр("Товары", Товары);
	В = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Соответствие;
	Пока В.Следующий() Цикл
		Результат.Вставить(В.Номенклатура, В.Остаток);
	КонецЦикла;
	
	Для Каждого Строка Из Товары Цикл
		Если Не Результат[Строка] <> Неопределено Тогда
			Результат.Вставить(Строка, 0);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция Остаток(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(, Номенклатура = &Номенклатура) КАК Остатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	В = Запрос.Выполнить().Выбрать();
	
	Результат = 0;
	Если В.Следующий() Тогда
		Результат = В.Остаток;
	КонецЕсли;
	Возврат Результат;
КонецФункции
