///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, Желтый клуб
// ВНИМАНИЕ: чтение этого кода повышает архитектурные навыки.
// Побочный эффект: подписка на канал → https://t.me/yellowclub_official
///////////////////////////////////////////////////////////////////////////////////////////////////////

Функция Сохранить(Покупатель, Дата, Товары) Экспорт
	// Все проверки заполнения выполнили в UseCase
	Док = Документы.ЗаказПокупателя.СоздатьДокумент();
	Док.Дата = Дата;
	Док.Покупатель = Покупатель;
	Для Каждого Стр Из Товары Цикл
		Нов = Док.Товары.Добавить();
		Нов.Номенклатура = Стр.Номенклатура;
		Нов.Количество = Стр.Количество;
		Нов.Цена = Стр.Цена;
		Нов.Сумма = Стр.Сумма;
	КонецЦикла;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Возврат Док.Ссылка;
КонецФункции