
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизитыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьПараметрыАутентификации(ТекущийОбъект.Ссылка);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьСтраницыПрокси();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапки

&НаКлиенте
Процедура ИспользоватьПроксиПриИзменении(Элемент)
	УстановитьВидимостьСтраницыПрокси();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтраницыПрокси()
	Элементы.СтраницаПрокси.Видимость = Объект.ИспользоватьПрокси;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ТестСоединенияНаСервере()
	
//	Ошибки = Неопределено;
//	Результат = Справочники.гкс_ПодключениеКВебСервисам.СоединениеССервером(Объект.Ссылка, Ошибки);
//	
//	Отказ = Ложь;
//	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
//	Если Не Отказ Тогда
//		ТекстСообщения = НСтр("ru = 'Соединение установлено'");
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
//	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСоединения(Команда)
	
	ТестСоединенияНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	ИмяПользователя = XMLСтрока(УникальныйИдентификатор);
	ПарольПользователя = XMLСтрока(УникальныйИдентификатор);
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыАутентификации(СервисСсылка)
	
	Если ИмяПользователя = XMLСтрока(УникальныйИдентификатор) 
	     И ПарольПользователя = XMLСтрока(УникальныйИдентификатор) Тогда
		Возврат;	     	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения
	     .ЗаписатьДанныеВБезопасноеХранилище(СервисСсылка, 
	                                         Новый Структура("ИмяПользователя, ПарольПользователя", 
	                                                         ИмяПользователя, ПарольПользователя), 
	                                         "ИмяПарольПользователя");	
КонецПроцедуры

#КонецОбласти



