#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Данные для список произвольный композит.
// 
// Параметры:
//  Параметры Параметры
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные для список произвольный композит
Функция ДанныеДляСписокПроизвольныйКомпозит(Параметры) Экспорт

	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеДляДетальныхЗаписей();  
	
	Запрос.УстановитьПараметр("СписокСостояний", СписокСостояний);
	
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ПроизводственныеСутки", Параметры.ПроизводственныеСуткиРегистрации);
	
	Запрос.УстановитьПараметр("ОтборПоНоменклатуреУстановлен", ЗначениеЗаполнено(Номенклатура));
	Запрос.УстановитьПараметр("ОтборНоменклатура", Номенклатура);
	
	Запрос.УстановитьПараметр("ОтборПоКонтрагентуУстановлен", ЗначениеЗаполнено(Контрагент));
	Запрос.УстановитьПараметр("ОтборКонтрагент", Контрагент);
	
	Запрос.УстановитьПараметр("ОтборПоДоговоруУстановлен", ЗначениеЗаполнено(Договор));
	Запрос.УстановитьПараметр("ОтборДоговор", Договор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Данные для список промежуточные пробы.
// 
// Параметры:
//  Параметры Параметры
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные для список промежуточные пробы
Функция ДанныеДляСписокПромежуточныеПробы(Параметры) Экспорт

	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеДляПромежуточныхПроб();  
	
	Запрос.УстановитьПараметр("СписокСостояний", СписокСостояний);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ПроизводственныеСутки", Параметры.ПроизводственныеСуткиРегистрации);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции	


// Данные для список регистрации промежуточных проб.
// 
// Параметры:
//  Параметры Параметры
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные для список регистрации промежуточных проб
Функция ДанныеДляСписокРегистрацииПромежуточныхПроб(Параметры) Экспорт

	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеДляРегистрацииПромежуточныхПроб();  

	Запрос.УстановитьПараметр("ДокументФормированиеНомераПробы", Параметры.ДокументФормированиеНомераПробы);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаДанныеДляДетальныхЗаписей() 
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	СостоянияРегистрации.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТ_Регистрации
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних({&КонецПериода}, ВидПеревозки = &ВидПеревозки
	|	И ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|	И Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТочкаМаршрута = &ТочкаМаршрута) КАК СостоянияРегистрации
	|ГДЕ
	|	СостоянияРегистрации.Состояние В (&СписокСостояний)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КомпозитныеПробы.ДокументРегистрации КАК ДокументРегистрации,
	|	КомпозитныеПробы.КомпозитнаяПроба КАК КомпозитнаяПроба,
	|	ЕСТЬNULL(СправочникНомераПроб.Код, """") КАК НомерПробы,
	|	КомпозитныеПробы.ПроизводственныеСуткиРегистрации КАК ПроизводственныеСутки
	|ПОМЕСТИТЬ ВТ_КомпозитныеПробы
	|ИЗ
	|	РегистрСведений.гкс_КомпозитныеПробы КАК КомпозитныеПробы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО ВТ_Регистрации.ДокументРегистрации = КомпозитныеПробы.ДокументРегистрации
	|		И КомпозитныеПробы.ВидПеревозки = &ВидПеревозки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_НомерПробы КАК СправочникНомераПроб
	|			ПО ФормированиеНомераПробы.НомерПробы = СправочникНомераПроб.Ссылка
	|		ПО КомпозитныеПробы.КомпозитнаяПроба = ФормированиеНомераПробы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Регистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ФормированиеНомераПробы.Ссылка КАК ЕдиничнаяПроба,
	|	ЕСТЬNULL(СправочникНомераПроб.Код, """") КАК НомерПробы
	|ПОМЕСТИТЬ ВТ_ЕдиничныеПробы
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО ВТ_Регистрации.ДокументРегистрации = ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_НомерПробы КАК СправочникНомераПроб
	|			ПО ФормированиеНомераПробы.НомерПробы = СправочникНомераПроб.Ссылка
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ФормированиеНомераПробы.Ссылка
	|		И ФормированиеНомераПробы.Проведен
	|		И ФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацияНаПЛК.Ссылка КАК ДокументРегистрации,
	|	РегистрацияНаПЛК.Дата КАК ДатаРегистрации,
	|	РегистрацияНаПЛК.Организация КАК Организация,
	|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
	|	РегистрацияНаПЛК.ТочкаМаршрута КАК ПЛК,
	|	РегистрацияНаПЛК.Контрагент КАК Контрагент,
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
	|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
	|	РегистрацияНаПЛК.ПунктПогрузки КАК ПунктПогрузки,
	|	ЕСТЬNULL(НаправлениеНаРазгрузку.Ссылка, ЗНАЧЕНИЕ(Документ.гкс_НаправлениеНаРазгрузку.ПустаяСсылка)) КАК
	|		НаправлениеНаРазгрузку,
	|	ЕСТЬNULL(НаправлениеНаРазгрузку.СлужебнаяНоменклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК
	|		СлужебнаяНоменклатура,
	|	ЕСТЬNULL(ВТ_КомпозитныеПробы.КомпозитнаяПроба, ЗНАЧЕНИЕ(Документ.гкс_ФормированиеНомераПробы.ПустаяСсылка)) КАК
	|		ДокументКомпозитнаяПроба,
	|	ЕСТЬNULL(ВТ_КомпозитныеПробы.НомерПробы, NULL) КАК НомерПромежуточногоКомпозита,
	|	ЕСТЬNULL(ВТ_ЕдиничныеПробы.ЕдиничнаяПроба, ЗНАЧЕНИЕ(Документ.гкс_ФормированиеНомераПробы.ПустаяСсылка)) КАК
	|		ФормированиеПробы,
	|	ЕСТЬNULL(ВТ_ЕдиничныеПробы.НомерПробы, NULL) КАК НомерПробы,
	|	ЕСТЬNULL(ВТ_Регистрации.Состояние, ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ПустаяСсылка)) КАК Состояние,
	|	ЕСТЬNULL(СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент.ПунктПогрузки.КодСтанцииЖД, NULL) КАК
	|		СтанцияОтправления,
	|	ЕСТЬNULL(СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент.ПунктПогрузки.КодСтанцииЖД.НаименованиеПолное,
	|		NULL) КАК СтанцияОтправленияПредставление,
	|	ЕСТЬNULL(СпецификацияКДоговору.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор
	|ИЗ
	|	ВТ_Регистрации КАК ВТ_Регистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ВТ_Регистрации.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|		ПО ВТ_Регистрации.ДокументРегистрации = НаправлениеНаРазгрузку.ДокументРегистрации
	|		И НаправлениеНаРазгрузку.Проведен
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеВъезд
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВзвешиваниеВъезд.ДокументРегистрации
	|		И ВзвешиваниеВъезд.Проведен
	|		И ВзвешиваниеВъезд.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Въезд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеВыезд
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВзвешиваниеВыезд.ДокументРегистрации
	|		И ВзвешиваниеВыезд.Проведен
	|		И ВзвешиваниеВыезд.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Выезд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомпозитныеПробы КАК ВТ_КомпозитныеПробы
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВТ_КомпозитныеПробы.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕдиничныеПробы КАК ВТ_ЕдиничныеПробы
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВТ_ЕдиничныеПробы.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК
	|			СвязьРегистрацииИТранспортногоДокумента
	|		ПО ВТ_Регистрации.ДокументРегистрации = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_СпецификацияКДоговоруКонтрагента КАК СпецификацияКДоговору
	|		ПО РегистрацияНаПЛК.Спецификация = СпецификацияКДоговору.Ссылка
	|ГДЕ
	|	(НЕ &ОтборПоНоменклатуреУстановлен
	|	ИЛИ РегистрацияНаПЛК.Номенклатура = &ОтборНоменклатура)
	|	И (НЕ &ОтборПоКонтрагентуУстановлен
	|	ИЛИ РегистрацияНаПЛК.Контрагент = &ОтборКонтрагент)
	|	И (НЕ &ОтборПоДоговоруУстановлен
	|	ИЛИ СпецификацияКДоговору.Договор = &ОтборДоговор)
	|	И ВЫБОР
	|		КОГДА НЕ ВТ_КомпозитныеПробы.ДокументРегистрации ЕСТЬ NULL
	|		И НЕ ВТ_КомпозитныеПробы.ПроизводственныеСутки = &ПроизводственныеСутки
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";
	
КонецФункции

Функция ТекстЗапросаДанныеДляПромежуточныхПроб()
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	СостоянияРегистрации.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТ_Регистрации
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних({&КонецПериода}, ВидПеревозки = &ВидПеревозки
	|	И ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|	И Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТочкаМаршрута = &ТочкаМаршрута) КАК СостоянияРегистрации
	|ГДЕ
	|	СостоянияРегистрации.Состояние В (&СписокСостояний)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба КАК ДокументФормированиеНомераПробы,
	|	МАКСИМУМ(ЛабораторныйАнализ.Ссылка) КАК ЛабораторныйАнализ
	|ПОМЕСТИТЬ ВТ_ПервичныеДанныеПоРегистрации
	|ИЗ
	|	РегистрСведений.гкс_КомпозитныеПробы КАК РегистрСведенийКомпозитныеПробы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ПО РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба = ЛабораторныйАнализ.гкс_ДокументРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО РегистрСведенийКомпозитныеПробы.ДокументРегистрации = ВТ_Регистрации.ДокументРегистрации
	|ГДЕ
	|	РегистрСведенийКомпозитныеПробы.ТочкаМаршрута = &ТочкаМаршрута
	|	И РегистрСведенийКомпозитныеПробы.ПроизводственныеСуткиРегистрации = &ПроизводственныеСутки
	|	И РегистрСведенийКомпозитныеПробы.ВидПеревозки = &ВидПеревозки
	|СГРУППИРОВАТЬ ПО
	|	РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба КАК ДокументФормированиеНомераПробы,
	|	МАКСИМУМ(ЛабораторныйАнализ.Ссылка) КАК ЛабораторныйАнализ
	|ПОМЕСТИТЬ ВТ_ПервичныеДанныеПромежуточныйКомпозит
	|ИЗ
	|	РегистрСведений.гкс_КомпозитныеПробы КАК РегистрСведенийКомпозитныеПробы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ПО РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба = ЛабораторныйАнализ.гкс_ДокументРегистрации
	|ГДЕ
	|	РегистрСведенийКомпозитныеПробы.ТочкаМаршрута = &ТочкаМаршрута
	|	И РегистрСведенийКомпозитныеПробы.ПроизводственныеСуткиРегистрации = &ПроизводственныеСутки
	|	И РегистрСведенийКомпозитныеПробы.ВидПеревозки = &ВидПеревозки
	|	И
	|		ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|СГРУППИРОВАТЬ ПО
	|	РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПервичныеДанныеПоРегистрации.ДокументФормированиеНомераПробы КАК ДокументФормированиеНомераПробы,
	|	ВТ_ПервичныеДанныеПоРегистрации.ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|ПОМЕСТИТЬ ВТ_ПервичныеДанные
	|ИЗ
	|	ВТ_ПервичныеДанныеПоРегистрации КАК ВТ_ПервичныеДанныеПоРегистрации
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ПервичныеДанныеПромежуточныйКомпозит.ДокументФормированиеНомераПробы,
	|	ВТ_ПервичныеДанныеПромежуточныйКомпозит.ЛабораторныйАнализ
	|ИЗ
	|	ВТ_ПервичныеДанныеПромежуточныйКомпозит КАК ВТ_ПервичныеДанныеПромежуточныйКомпозит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПервичныеДанные.ДокументФормированиеНомераПробы КАК ДокументКомпозитнаяПроба,
	|	ВТ_ПервичныеДанные.ЛабораторныйАнализ КАК ПромежуточныйКомпозит,
	|	ВЫБОР
	|		КОГДА
	|			ВТ_ПервичныеДанные.ЛабораторныйАнализ.Статус = ЗНАЧЕНИЕ(Перечисление.гкс_СтатусыЛабораторногоАнализа.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СтатусыЛабораторногоАнализа.ОтборПробы)
	|		ИНАЧЕ ВТ_ПервичныеДанные.ЛабораторныйАнализ.Статус
	|	КОНЕЦ КАК Статус,
	|	ВТ_ПервичныеДанные.ЛабораторныйАнализ.Номер КАК ЛабораторныйАнализНомер,
	|	ЕСТЬNULL(Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ВТ_ПервичныеДанные.ДокументФормированиеНомераПробы.НомерПробы КАК НомерПробы
	|ИЗ
	|	ВТ_ПервичныеДанные КАК ВТ_ПервичныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_ПервичныеДанные.ЛабораторныйАнализ.Номенклатура = Номенклатура.Ссылка";
	
КонецФункции

Функция ТекстЗапросаДанныеДляРегистрацииПромежуточныхПроб()
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрСведенийКомпозитныеПробы.ДокументРегистрации КАК ДокументРегистрации
	|ИЗ
	|	РегистрСведений.гкс_КомпозитныеПробы КАК РегистрСведенийКомпозитныеПробы
	|ГДЕ
	|	РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба = &ДокументФормированиеНомераПробы";
	 	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли