
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьПериодПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьВходящиеДанные(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ОтборПоОрганизации) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать организацию.'"));
		Возврат;
	КонецЕсли;
	
	ПолучитьВходящиеДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВходящиеДанные(Команда)
	ОбработатьВходящиеДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчисткуУстаревшихДанных(Команда)
	ВыполнитьОчисткуУстаревшихДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЛогСобытийВебСервисов(Команда)
	
	ОткрытьФорму("РегистрСведений.гкс_ЛогСобытийВебСервисов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодключениеКВебСервисам(Команда)
	
	ОткрытьФорму("Справочник.гкс_ПодключениеКВебСервисам.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРесурсыВебСервисов(Команда)
	
	ОткрытьФорму("Справочник.гкс_РесурсыВебСервисов.ФормаСписка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьВходящиеДанныеНаСервере()
	
	ПараметрПериоды = Новый Структура;
	ПараметрПериоды.Вставить("ДатаНачала", 	Периоды.ДатаНачала);
	ПараметрПериоды.Вставить("ДатаКонец", 	Периоды.ДатаОкончания);
	
	ЕстьПараметры = ИспользоватьПериод 
					И ЗначениеЗаполнено(Периоды.ДатаНачала) 
					И ЗначениеЗаполнено(Периоды.ДатаОкончания);
	
	Если ЕстьПараметры Тогда
		гкс_ИнтеграцияWarehouse.ПолучитьДанныеWarehouse(ПараметрПериоды);
	Иначе
		гкс_ИнтеграцияWarehouse.ПолучитьДанныеWarehouse();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВходящиеДанныеНаСервере()
	
	ПараметрОбработки = Справочники.гкс_НастройкиИнтеграцииWarehouse.НастройкиИнтеграции(); 
	
	гкс_ИнтеграцияWarehouse.ОбработатьВходящиеДанныеWarehouse(ПараметрОбработки);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОчисткуУстаревшихДанныхНаСервере()
	
	гкс_ИнтеграцияWarehouseСлужебный.ВыполнитьОчисткуУстаревшихДанныхWarehouse();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.Периоды.Доступность = ИспользоватьПериод;
	
КонецПроцедуры

#КонецОбласти
