///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, Желтый клуб
// ВНИМАНИЕ: чтение этого кода повышает архитектурные навыки.
// Побочный эффект: подписка на канал → https://t.me/yellowclub_official
///////////////////////////////////////////////////////////////////////////////////////////////////////

Перем Уровень; // защитный счётчик, чтобы не закрыть транзакцию раньше времени

//Защищаем usecase по полной от платформы. Даже транзакции оборачиваем
Процедура Начать() Экспорт
	Если Уровень = 0 Тогда
		НачатьТранзакцию();
	КонецЕсли;
	Уровень = Уровень + 1;
КонецПроцедуры

Процедура Зафиксировать() Экспорт
	Если Уровень <= 0 Тогда
		ВызватьИсключение "ТранзакцияНеОткрыта";
	КонецЕсли;
	
	Уровень = Уровень - 1;
	
	Если Уровень = 0 Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Процедура Откатить()  Экспорт
	Если Уровень > 0 Тогда
		Уровень = 0;
		ОтменитьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Уровень = 0;