///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, Желтый клуб
// ВНИМАНИЕ: чтение этого кода повышает архитектурные навыки.
// Побочный эффект: подписка на канал → https://t.me/yellowclub_official
///////////////////////////////////////////////////////////////////////////////////////////////////////

// Это пример сущности. В конфиграции не используется. 
// Акцент на то, что сущности это не просто данные, но и поведение
// Пока самый сложный вопрос для 1С сферы именно как сделать хорошие сущности
// Просто структура с именем Номенклатура и полями не являtтся сущностью
// это простой DTO
Функция Сделать(Артикул, Наименование, БазоваяЕд, ВесНетто, Тара) Экспорт
	Т = Новый Структура;
	Т.Вставить("Артикул", Артикул);
	Т.Вставить("Наименование", СтрЗаменить(Наименование, Символы.Таб, " "));
	Т.Вставить("БазоваяЕд", БазоваяЕд);
	Т.Вставить("ВесНетто", Макс(0, ВесНетто));
	Т.Вставить("Тара", Макс(0, Тара));
	Т.Вставить("ВесБрутто", Т.ВесНетто + Т.Тара);
	Возврат Т;
КонецФункции

Функция Проверить(Ном, Порты) Экспорт
	Ошибки = Новый Массив;
	Если ПустаяСтрока(Ном.Наименование) Тогда 
		Ошибки.Добавить("Пустое наименование."); 
	КонецЕсли;
	
	Если Ном.БазоваяЕд = Неопределено Тогда 
		Ошибки.Добавить("Не задана базовая единица."); 
	КонецЕсли;
	
	Если Порты.НоменклатураСУказаннымАртикуломСуществует(Ном.Артикул) Тогда
		Ошибки.Добавить("Дублирующий артикул.");
	КонецЕсли;
	Возврат Ошибки;
КонецФункции
















