///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, Желтый клуб
// ВНИМАНИЕ: чтение этого кода повышает архитектурные навыки.
// Побочный эффект: подписка на канал → https://t.me/yellowclub_official
///////////////////////////////////////////////////////////////////////////////////////////////////////

Функция Оформить(Покупатель, Дата, Товары) Экспорт
	
	// 0) Собираем порты
	
	// По хорошему это не ответственность Контроллера — собирать порты
	// Ответственность контроллера — собрать инпуты и дернуть usecase
	// Но куда лучше в 1С положить зависимости UseCase я пока не знаю
	Порты = Новый Структура("Склад, Кредит, Транзакции, Заказы, БонусРеестр");
	Порты.Склад = Склад;
	Порты.Кредит = Кредит;
	Порты.Транзакции = Обработки.Транзакции.Создать();
	Порты.Заказы = Заказы;
	Порты.БонусРеестр = Бонусы;
	
	Выход = Обработки.ПрезентерЗаказы.Создать();
	
	// 1) Собираем InputDTO
	Строки = Новый Массив;
	Для Каждого Строка Из Товары Цикл
		Строки.Добавить(Новый Структура("Номенклатура,Количество,Цена",
		Строка.Номенклатура, Строка.Количество, Строка.Цена));
	КонецЦикла;
	
	Запрос = Новый Структура("Покупатель, Дата, Строки");
	Запрос.Покупатель = Покупатель;
	Запрос.Дата = Дата;
	Запрос.Строки = Строки;
	
	// 2) Вызываем use case (ничего не возвращает — пишет в презентер)
	ЮзКейс_ОформитьЗаказ.ВыполнитьЮзКейс(Запрос, Порты, Выход);
	
	// 3) Отдаём ViewModel, подготовленный презентером
	Возврат Выход.ViewModel();
КонецФункции





