///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, Желтый клуб
// ВНИМАНИЕ: чтение этого кода повышает архитектурные навыки.
// Побочный эффект: подписка на канал → https://t.me/yellowclub_official
///////////////////////////////////////////////////////////////////////////////////////////////////////

// Это еще одна попытка изобразить сущности в 1С
// Тут сконцентрированы важные бизнес правила
// Важно понять, что объекты метаданных не могут являться сущностями
// объекты метаданны — это часть фреймворка
Функция КоличествоКорректно(Знач Количество) Экспорт
	Возврат ТипЗнч(Количество) = Тип("Число") И Количество >= 0;
КонецФункции

Функция СуммаПоПравилу(Знач Цена, Знач Количество) Экспорт
	Возврат Окр(Цена * Количество, 2, РежимОкругления.Окр15как20);
КонецФункции

Функция МожноОтгрузить(Знач ДоступныйОстаток, Знач Количество) Экспорт
	Возврат ДоступныйОстаток >= Количество;
КонецФункции

Функция РассчитатьБонусы(Знач Сумма) Экспорт
	Возврат Макс(0, Окр(Сумма * 0.02, 2));
КонецФункции

